taifuer/esp32-rlcd-firmware/sdkconfig.defaults
# ESP32-S3-RLCD-4.2 hardware defaults, based on the Waveshare ESP-IDF examples.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y
CONFIG_LWIP_SNTP_MAX_SERVERS=3

# Project defaults for the temporary provisioning access point. Keep the
# password empty so each provisioning session receives a fresh random value.
CONFIG_RLCD_SETUP_AP_SSID="ESP32-RLCD"
CONFIG_RLCD_SETUP_AP_APPEND_DEVICE_ID=y
CONFIG_RLCD_SETUP_AP_PASSWORD=""
